MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFK100/mcu.h
extern volatile __C1FIFOINT27bits_t C1FIFOINT27bits __asm__ ("C1FIFOINT27") __attribute__((section("sfrs"), address(0xBF880A20)));
extern volatile uint32_t        C1FIFOINT27CLR __attribute__((section("sfrs"),address(0xBF880A24)));
extern volatile uint32_t        C1FIFOINT27SET __attribute__((section("sfrs"),address(0xBF880A28)));
extern volatile uint32_t        C1FIFOINT27INV __attribute__((section("sfrs"),address(0xBF880A2C)));
#define C1FIFOUA27 C1FIFOUA27
extern volatile uint32_t   C1FIFOUA27 __attribute__((section("sfrs"), address(0xBF880A30)));
extern volatile uint32_t        C1FIFOUA27CLR __attribute__((section("sfrs"),address(0xBF880A34)));
extern volatile uint32_t        C1FIFOUA27SET __attribute__((section("sfrs"),address(0xBF880A38)));
extern volatile uint32_t        C1FIFOUA27INV __attribute__((section("sfrs"),address(0xBF880A3C)));
#define C1FIFOCI27 C1FIFOCI27
extern volatile uint32_t   C1FIFOCI27 __attribute__((section("sfrs"), address(0xBF880A40)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI27bits_t;
extern volatile __C1FIFOCI27bits_t C1FIFOCI27bits __asm__ ("C1FIFOCI27") __attribute__((section("sfrs"), address(0xBF880A40)));
extern volatile uint32_t        C1FIFOCI27CLR __attribute__((section("sfrs"),address(0xBF880A44)));
extern volatile uint32_t        C1FIFOCI27SET __attribute__((section("sfrs"),address(0xBF880A48)));
extern volatile uint32_t        C1FIFOCI27INV __attribute__((section("sfrs"),address(0xBF880A4C)));
#define C1FIFOCON28 C1FIFOCON28
extern volatile uint32_t   C1FIFOCON28 __attribute__((section("sfrs"), address(0xBF880A50)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON28bits_t;
extern volatile __C1FIFOCON28bits_t C1FIFOCON28bits __asm__ ("C1FIFOCON28") __attribute__((section("sfrs"), address(0xBF880A50)));
extern volatile uint32_t        C1FIFOCON28CLR __attribute__((section("sfrs"),address(0xBF880A54)));
extern volatile uint32_t        C1FIFOCON28SET __attribute__((section("sfrs"),address(0xBF880A58)));
extern volatile uint32_t        C1FIFOCON28INV __attribute__((section("sfrs"),address(0xBF880A5C)));
#define C1FIFOINT28 C1FIFOINT28
extern volatile uint32_t   C1FIFOINT28 __attribute__((section("sfrs"), address(0xBF880A60)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT28bits_t;
extern volatile __C1FIFOINT28bits_t C1FIFOINT28bits __asm__ ("C1FIFOINT28") __attribute__((section("sfrs"), address(0xBF880A60)));
extern volatile uint32_t        C1FIFOINT28CLR __attribute__((section("sfrs"),address(0xBF880A64)));
extern volatile uint32_t        C1FIFOINT28SET __attribute__((section("sfrs"),address(0xBF880A68)));
extern volatile uint32_t        C1FIFOINT28INV __attribute__((section("sfrs"),address(0xBF880A6C)));
#define C1FIFOUA28 C1FIFOUA28
extern volatile uint32_t   C1FIFOUA28 __attribute__((section("sfrs"), address(0xBF880A70)));
extern volatile uint32_t        C1FIFOUA28CLR __attribute__((section("sfrs"),address(0xBF880A74)));
extern volatile uint32_t        C1FIFOUA28SET __attribute__((section("sfrs"),address(0xBF880A78)));
extern volatile uint32_t        C1FIFOUA28INV __attribute__((section("sfrs"),address(0xBF880A7C)));
#define C1FIFOCI28 C1FIFOCI28
extern volatile uint32_t   C1FIFOCI28 __attribute__((section("sfrs"), address(0xBF880A80)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI28bits_t;
extern volatile __C1FIFOCI28bits_t C1FIFOCI28bits __asm__ ("C1FIFOCI28") __attribute__((section("sfrs"), address(0xBF880A80)));
extern volatile uint32_t        C1FIFOCI28CLR __attribute__((section("sfrs"),address(0xBF880A84)));
extern volatile uint32_t        C1FIFOCI28SET __attribute__((section("sfrs"),address(0xBF880A88)));
extern volatile uint32_t        C1FIFOCI28INV __attribute__((section("sfrs"),address(0xBF880A8C)));
#define C1FIFOCON29 C1FIFOCON29
extern volatile uint32_t   C1FIFOCON29 __attribute__((section("sfrs"), address(0xBF880A90)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON29bits_t;
extern volatile __C1FIFOCON29bits_t C1FIFOCON29bits __asm__ ("C1FIFOCON29") __attribute__((section("sfrs"), address(0xBF880A90)));
extern volatile uint32_t        C1FIFOCON29CLR __attribute__((section("sfrs"),address(0xBF880A94)));
extern volatile uint32_t        C1FIFOCON29SET __attribute__((section("sfrs"),address(0xBF880A98)));
extern volatile uint32_t        C1FIFOCON29INV __attribute__((section("sfrs"),address(0xBF880A9C)));
#define C1FIFOINT29 C1FIFOINT29
extern volatile uint32_t   C1FIFOINT29 __attribute__((section("sfrs"), address(0xBF880AA0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT29bits_t;
